stress.yml
config:
  target: 'http://127.0.0.1:3000'
  phases:
    - duration: 30
      arrivalRate: 10
      rampTo: 150
      name: "Service spooling"
    - duration: 30
      arrivalRate: 150
      name: "Sustained Load for 30 sec"
  variables:
    ids:
      - ["9828881", "9829581", "9830760", "9831065", "9831381", "9832469", "9832504", "9833746", "9835160", "9835338", "9835648", "9836045", "9836061", "9837784", "9838668", "9840817", "9841708", "9843181", "9844407", "9845680", "9846513", "9847944", "9849115", "9849372", "9850467", "9850581", "9851232", "9852513", "9854475", "9854909", "9855942", "9856694", "9857104", "9857721", "9858420", "9858688", "9860304", "9860356", "9860603", "9860622", "9861386", "9861527", "9861818", "9861946", "9862283", "9863811", "9863901", "9864118", "9864535", "9865240", "9866698", "9868140", "9868344", "9868346", "9869695", "9869804", "9870422", "9870645", "9870903", "9871115", "9872780", "9873913", "9874312", "9876869", "9878322", "9879646", "9880679", "9881266", "9882295", "9883123", "9884401", "9884788", "9887311", "9888776", "9889235", "9889547", "9889789", "9890049", "9890488", "9891489", "9891809", "9892154", "9892207", "9893290", "9893594", "9893840", "9893864", "9894179", "9894241", "9894405", "9894772", "9895583", "9896293", "9896653", "9896960", "9897761", "9898567", "9899531", "9902630", "9905250", "9906735", "9907926", "9910005", "9911785", "9912537", "9914182", "9914205", "9914546", "9915569", "9915732", "9915809", "9916136", "9916588", "9916670", "9917597", "9918195", "9922778", "9923404", "9923714", "9924399", "9924507", "9925215", "9925275", "9925453", "9927565", "9928565", "9929830", "9930954", "9933239", "9934020", "9934591", "9935150", "9935191", "9936527", "9937160", "9938399", "9938614", "9938734", "9938831", "9939129", "9942770", "9943574", "9944342", "9945777", "9946005", "9948154", "9948691", "9950210", "9951917", "9952561", "9954258", "9954313", "9955005", "9956868", "9957521", "9958194", "9960191", "9960771", "9961709", "9964199", "9964211", "9964432", "9965112", "9965665", "9966013", "9966690", "9966723", "9966794", "9967891", "9967936", "9968919", "9969743", "9971527", "9971948", "9974400", "9975025", "9977585", "9977794", "9978648", "9978935", "9979623", "9979885", "9980096", "9981002", "9981124", "9982493", "9982904", "9983601", "9985600", "9986988", "9987553", "9988257", "9990146", "9990489", "9996043", "9998224", "9998416"]
scenarios:
  - flow:
    - post:
          url: "/stress/images/"
    - loop:
        - get:
            url: "/api/images/{{ $loopElement }}"
      over: ids